 
[
    
  {
    "id": 1,
    "name": "ECOFEST-24, TNAU, CBE",
    "date": "2024-08-01",
    "category": "2024",
    "image": "../src/assets/images/id1.png",
    "description": "In August 2024, the project gained international recognition by being selected to present at ECOFEST-24, the International Conference hosted by Tamil Nadu Agricultural University (TNAU), Coimbatore. Among numerous applicants, the project was chosen to showcase its innovative approach on a global platform, highlighting its relevance to sustainable agriculture and smart farming practices. This milestone not only expanded the project’s visibility but also positioned it within an international network of researchers, innovators, and practitioners."
    

  },
  {
    "id": 2,
    "name": "ELECTROSPHERE 2K24",
    "date": "2024-09-01",
    "category": "2024",
    "image": "../src/assets/images/id2.png",
    "description": "In September 2024, the project participated in Electrosphere 2K24, a technical fest hosted by Tamil Nadu Agricultural University (TNAU), Coimbatore. The event provided a platform for the project to present its innovative solutions to a diverse audience of technical enthusiasts, industry professionals, and researchers. The project's successful presentation at Electrosphere 2K24 underscored its relevance to the field of agriculture and its potential to drive sustainable practices in the agricultural sector."
  },
  {
    "id": 3,
    "name": "SMART INDIA HACKATHON 2024",
    "date": "2024-11-01",
    "category": "Hackathon",
    "image": "../src/assets/images/id3.png",
    "description": "In November 2024, the project participated in the Smart India Hackathon 2024, a national-level hackathon hosted by the Government of Tamil Nadu. The event provided a platform for students, researchers, and industry professionals to collaborate on innovative solutions to real-world problems. The project's successful implementation of the hackathon's challenge focused on sustainable agriculture and smart farming practices, highlighting its relevance to the field of agriculture."
  },
  {
    "id": 4,
    "name": "Naan Mudhalvan Niral Thiruvizha 2025",
    "date": "2025-01-20",
    "category": "2025",
    "image": "../src/assets/images/id4.png",
    "description": "In January 2025, the project advanced further by applying to the Naan Mudhalvan Niral Thiruvizha 2.0, a large-scale innovation and entrepreneurship initiative. Out of a total of 15,337 applicants, the idea was successfully shortlisted among the Top 1000 teams, reflecting its competitiveness, innovative strength, and potential for scalability."
  },
  {
    "id": 5,
    "name": "GCDI’25-NIT,Calicut, Kerala, India",
    "date": "2025-03-15",
    "category": "2025",
    "image": "../src/assets/images/id5.png",
    "description": "In March 2025, the project was showcased at the NIT Calicut Global Conference, where the final-year research work was formally presented. This platform provided an opportunity to engage with global experts, academicians, and industry professionals, further enhancing the project’s credibility and strengthening its position within the broader innovation ecosystem."
  },
  {
    "id": 6,
    "name": "Ideathon-RVSCET, CBE",
    "date": "2025-04-01",
    "category": "2025",
    "image": "../src/assets/images/id6.png",
    "description": "In April 2025, the project participated in the RVS Ideation, competing against 110 teams from diverse institutions. The idea was not only shortlisted but also went on to secure the Third Prize, further reinforcing its innovative value and practical relevance. This recognition added to the growing list of accomplishments that validate the project’s potential for real-world application."
  },
  {
    "id": 7,
    "name": "Technovision-2k25",
    "date": "2025-04-10",
    "category": "2025",
    "image": "../src/assets/images/id7.png",
    "description": "In April 2025, the project was also recognized at the TechnoVision2k25 College Project Competition, where it was shortlisted among the Top 15 projects out of nearly 200 final-year teams. This recognition at the institutional level highlighted the project’s technical depth, innovative design, and potential to address real-world challenges effectively."
  },
  {
    "id": 8,
    "name": "ECOFEST-25 International Conference, TNAU, CBE",
    "date": "2025-05-23",
    "category": "2025",
    "image": "../src/assets/images/id8.png",
    "description": "In May 2025, the project was presented at the ECOFEST-25 International Conference, hosted by Tamil Nadu Agricultural University (TNAU), Coimbatore. During the event, I participated in the Idea Pitch Desk Competition, where it stood out among several innovative concepts and secured the Third Prize. This recognition highlighted the project’s entrepreneurial potential and its ability to address real-world challenges with practical, scalable solutions."
  },
  {
    "id": 9,
    "name": "ECOFEST-25 International Conference, TNAU, CBE",
    "date": "2025-05-15",
    "category": "2025",
    "image": "../src/assets/images/id9.png",
    "description": "In May 2025, the project was presented at the ECOFEST-25 International Conference, hosted by Tamil Nadu Agricultural University (TNAU), Coimbatore. The team’s research presentation earned the Best Oral Presentation Award, showcasing the project’s academic depth, technical rigor, and relevance to global discussions on sustainable agriculture."
  }

]
